//
//  Resource.h
//  hello
//
//  Created by 吴凡 on 14-3-14.
//
//
//TAG分配
//HeroSelect:
//英雄属性面板：110
//英雄头像：101
//英雄名称：102
//英雄插画：103
//灵魂石增加按钮：104
//灵魂石精灵：106
//灵魂石进度条：108
//进阶按钮：109
//详细属性按钮：113
//详细技能按钮：112
//英雄等级：114
//英雄经验：115
//英雄星级：116~125

//
//英雄面板/英雄介绍：110/1
//英雄面板/生命值：110/2
//英雄面板/攻击力：110/3
//英雄面板/攻击速度：110/4
//英雄面板/攻击距离：110/5
//英雄面板/移动速度：110/6
//英雄面板/生命值2：110/7
//英雄面板/攻击力2：110/8
//英雄面板/攻击速度2：110/9
//英雄面板/攻击距离2：110/10
//英雄面板/移动速度2：110/11

//灵魂石途径
//英雄名字：1
//英雄头像：2
//途径1星球：3
//途径1类型：4
//途径1小关：5
//途径2星球：6
//途径2类型：7
//途径2小关：8
//途径3星球：9
//途径3类型：10
//途径3小关：11
//灵魂石数量：12

//英雄技能介绍
//技能1图标：1
//技能1名字：2
//技能1条件：3
//技能1描述：4
//技能1gold：5
//技能1gold数：5/1
//技能1add：11
//技能2图标：6
//技能2名字：7
//技能2条件：8
//技能2描述：9
//技能2gold：10
//技能2gold数：10/1
//技能2add：12

#ifndef hello_Resource_h
#define hello_Resource_h
#define myData CCUserDefault::sharedUserDefault()

static const char r_selectBg[] = "spritelevel.png";
static const char r_selectlevel[] ="levelsprite.png";


#endif